bills = {
    20: "Ivan Franko", # умовно, що на купюрі зображений Іван Франко
    500: "Grigory Skovoroda" # умовно, що на купюрі зображений Григорій Сковорода
}
nominal = int(input("Введите номінал: ")) #умовно, що користувач вводить номінал купюри
if nominal in bills:
    print(nominal, bills[nominal], sep=", ") # умовно, що виводиться номінал і прізвище особи, зображеної на купюри
else:
        print("No bill.") # умовно, що виводиться повідомлення про відсутність купюри з таким номіналом
